Revit 2027 API
ScheduleDefinition.GetValidCategoriesForEmbeddedSchedule Method
 Get all categories that can be used for an embedded ScheduleDefinition in this ScheduleDefinition.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public ICollection<ElementId> GetValidCategoriesForEmbeddedSchedule()
Public Function GetValidCategoriesForEmbeddedSchedule As ICollection(Of ElementId)
public:
ICollection<ElementId^>^ GetValidCategoriesForEmbeddedSchedule()
member GetValidCategoriesForEmbeddedSchedule : unit -> ICollection<ElementId>
Return Value
ICollection<ElementId>
 The IDs of all valid categories.
See Also
Reference
ScheduleDefinition Class
Autodesk.Revit.DB Namespace